{
    "corpus": "Pelvic Fractures: Treatment, Symptoms & Types800.223.2273100 Years of Cleveland ClinicMyChartNeed Help?GivingCareersSearchClevelandClinic.orgFind A DoctorLocations & DirectionsPatients & VisitorsHealth LibraryInstitutes & DepartmentsAppointmentsHome/Health Library/Diseases & Conditions/Pelvic FracturesAdvertisementAdvertisementAdvertisementPelvic FracturesA pelvic fracture is a break in one or more of your bones in your pelvis. Pelvic fractures are an uncommon type of fracture that can range from mild to severe. While mild pelvic fractures usually don’t require surgery, severe fractures have to be fixed with surgery.ContentsArrow DownOverviewSymptoms and CausesDiagnosis and TestsManagement and TreatmentPreventionOutlook / PrognosisLiving WithContentsArrow DownOverviewSymptoms and CausesDiagnosis and TestsManagement and TreatmentPreventionOutlook / PrognosisLiving WithOverviewWhat is a pelvic fracture?A pelvic fracture happens when there’s a fracture (break) in one or more of your bones that make up your pelvis. Your pelvis is the area of your body below your abdomen that’s located between your hip bones. Pelvic fractures can be mild or severe.AdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyWhich bones make up the pelvis?The bones that make up your pelvis include:The sacrum (the large triangle-shaped bone at the base of your spine).The coccyx (tailbone).The hip bones, which include the ilium, ischium and pubis.Together, these bones form what’s known as the pelvic ring. Your pelvis is a highly stable structure that protects many important nerves, blood vessels and organs, including your internal reproductive organs, bladder and the lower part of your digestive tract. It also acts as an anchor for your leg muscles.What types of pelvic fractures are there?Since your pelvis is made of multiple bones, there are many types of pelvic fractures. In general, there are also several kinds of bone fractures depending on the pattern of the break, including:Closed or open (compound) fractures: If the fracture doesn’t break open your surrounding skin, it’s called a closed fracture. If the broken bone pierces through your skin, it’s called an open fracture or a compound fracture.Complete fractures: A complete fracture happens when your bone breaks into two pieces.Displaced fractures: When a gap forms where your bone’s fractured, it’s called a displaced fracture.Partial fractures: A partial fracture happens when the fracture doesn’t go all the way through your bone.Stress fractures: A stress fracture happens when your bone has a crack in it.In addition to the specific pattern that the fracture has, a pelvic fracture is also classified as being stable or unstable:Stable pelvic fracture: In a stable pelvic fracture, there’s usually only one break in your pelvis, and the broken parts of the bones aren’t displaced. Pelvic fractures that happen from low-impact events, such as a minor fall or running, are usually stable fractures.Unstable pelvic fracture: In an unstable pelvic fracture, there are often two or more breaks, and the ends of broken parts of the bones are displaced. Unstable pelvic fractures are most often caused by high-impact events such as a car crash.Although it’s not as common, there’s another type of pelvic fracture called an avulsion fracture. An avulsion fracture happens when a tendon or ligament tears away from the bone it’s attached to, taking a small fragment of bone with it.AdvertisementWho do pelvic fractures affect?Anyone can experience a pelvic fracture at any age. Mild pelvic fractures are more common in older people because they are more likely to have bone-weakening disorders such as osteoporosis. Severe pelvic fractures are most common in people aged 15 to 28 years. Under the age of 35, men are more likely to experience a pelvic fracture, while over the age of 35, women are more likely to experience a pelvic fracture.How common are pelvic fractures?Pelvic fractures aren’t very common. Only 3% of bone fractures that adults experience are pelvic fractures. Most pelvic fractures happen from high-impact events such as a car accident or falling from a significant height.AdvertisementSymptoms and CausesWhat are the signs and symptoms of a pelvic fracture?The symptoms of a pelvic fracture depend on how mild or severe it is. Pelvic fracture signs and symptoms can include:Experiencing pain in your groin, hip and/or lower back.Experiencing more intense pain when walking or moving your legs.Experiencing numbness or tingling in your groin area or legs.Experiencing pain in your abdomen.Having a difficult time peeing.Having a difficult time walking or standing.What causes pelvic fractures?A few situations and conditions can cause a pelvic fracture, including:High-impact events: Since your pelvis is a very stable bone structure, most pelvic fractures are caused by high-impact events such as a car accident or falling from a significant height. High-impact events usually cause unstable pelvic fractures.Bone-weakening diseases: Bone-weakening diseases such as osteoporosis can contribute to pelvic fractures. If you have a bone-weakening disease, you could get a pelvic fracture from doing a routine activity or from a minor fall. Pelvic fractures that are caused by bone-weakening diseases are usually stable fractures.Athletic activities: Although it’s not as common, someone who is playing a sport could get a pelvic fracture known as an avulsion fracture. This happens when a tendon or ligament tears away from the bone to which it’s attached. When the tendon or ligament tears away, it takes a small piece of bone with it. A pelvic avulsion fracture is usually a stable fracture.Diagnosis and TestsHow is a fractured pelvis diagnosed?All pelvic fractures require X-rays in order to be diagnosed. Your healthcare provider may have you undergo other imaging tests to learn more about your injury.What tests will be done to diagnose a pelvic fracture?The following imaging tests can be used to diagnose a pelvic fracture:X-rays: X-rays use radiation to take images of your bones. All pelvic fractures require X-rays so your healthcare provider can see which part of your pelvis is fractured, how mild or severe the fracture is, and so they can learn how the fracture needs to be treated.CT scan: A CT (computed tomography) scan uses multiple X-rays taken from different angles of your body to produce detailed images. A CT scan provides more detailed images than regular X-rays do. Your healthcare provider may have you undergo a CT scan to learn more about your pelvic fracture and to make sure you don’t have other related injuries.MRI: An MRI (magnetic resonance imaging) uses a large magnet, radio waves and a computer to make detailed images of your organs and bones. Your healthcare provider might have you undergo an MRI if they aren’t able to get enough information about your fracture from X-rays and a CT scan.Management and TreatmentHow do you treat a fractured pelvis?Treatment for a pelvic fracture depends on certain factors, including:How mild or severe your fracture is.The pattern and type of fracture.Which bones are displaced and how much they are displaced.Your overall health and if you have other injuries.Treatment for mild and stable fractures in which your bones aren’t displaced usually doesn’t involve surgery. Treatment for a stable fracture can include:Rest: Your healthcare provider will most likely recommend that you rest as much as possible so you don’t put extra stress and pressure on your pelvic fracture.Walking aids: Depending on where your pelvic fracture is, your healthcare provider may have you use a walking aid such as crutches, a walker or a wheelchair to avoid bearing weight on your leg(s). You may have to use the walking aid for up to three months or until your pelvis fully heals.Medications: Your healthcare provider may prescribe medication to relieve pain. They may also have you take a blood thinner medication (anticoagulant) to reduce your risk of having blood clots form in the veins of your legs and pelvis.Treatment for a more severe or unstable pelvic fracture usually requires one or more surgeries. Different types of pelvic fracture surgeries include:External fixation: Healthcare providers use external fixation to stabilize your pelvic area after a pelvic fracture. In this surgery, metal pins or screws are inserted into your bones through small incisions (surgical cuts) into your skin and muscle. The pins and screws stick out of your skin on both sides of your pelvis, and are attached to bars outside of your body. The resulting system acts as a stabilizing frame to hold your broken bones in their proper position while your fracture(s) heals.Skeletal traction: Skeletal traction is a pulley system outside of your body that helps realign the pieces of broken bone(s). During skeletal traction, a surgeon implants metal pins in your thighbone or shinbone that stick out of your skin to help position your leg. Weights attached to the pins gently pull on your leg, keeping the broken pelvic bone fragments in a more normal position.Open reduction and internal fixation: During open reduction and internal fixation surgery, the displaced pelvic bone fragments are first repositioned into their normal alignment. The fragments are then held together with screws or metal plates that are attached to the outer surface of the bone.People who experience a severe pelvic fracture from a high-impact accident often have other injuries or internal injuries caused by the pelvic fracture that will also need to be treated. In these cases, the success in treating the pelvic fracture often depends on the success of treating the related injuries.Can a fractured pelvis heal itself?Mild and stable pelvic fractures can usually heal without medical intervention such as surgery. However, if you have a mild pelvic fracture, you must limit the amount of pressure you put on your pelvis and legs and get enough rest so your fracture can heal properly. It’s important to see your healthcare provider as soon as possible even if you think you have a mild pelvic fracture.How long does a fractured pelvis take to heal?Pelvic fractures usually take 8 to 12 weeks to fully heal. More severe pelvic fractures could take longer, especially if you have other injuries or medical complications from the event that caused your pelvic fracture.Care at Cleveland ClinicGet Orthopaedic CareMake an AppointmentPreventionWhat are the risk factors for getting a pelvic fracture?Some risk factors for experiencing a pelvic fracture include:Having osteoporosis: People who have osteoporosis are at a higher risk of experiencing a pelvic fracture. Pelvic fractures account for 7% of all osteoporosis-related fractures in people over the age of 50 in the United States.Having a history of falls: People who have a history of falls, especially older people, are more likely to experience a pelvic fracture from falling.Playing certain sports: Although it’s the least common type of pelvic fracture, people who play certain sports can get a pelvic avulsion fracture if the tendon that attaches their hamstring muscle to their pelvis breaks away from their pelvis and takes a small bone fragment with it.What can I do to prevent a pelvic fracture?Depending on your age and lifestyle, there are a few things you can do to try to prevent fracturing your pelvis, including:Use a walking aid if you’re at a higher risk of falling: Using a walking aid such as a cane or a walker can help prevent you from falling, which could prevent you from getting a pelvic fracture.Drive safely: High-impact vehicle accidents are a common cause of pelvic fractures. Always practice safe driving and follow traffic laws. Avoid distractions while you’re driving.Follow ladder safety instructions: When you’re using a ladder, be sure you’re doing so properly and safely. Always make sure your ladder is in a secure position before using it.Do proper stretching and conditioning if you play sports: People who play certain sports are at risk of getting a pelvic avulsion fracture from a tendon tear. Be sure to properly stretch before activities and do conditioning exercises specific to your sport.Outlook / PrognosisWhat is the prognosis (outlook) of a pelvic fracture?The prognosis (outlook) for a pelvic fracture depends on the severity and type of injury. Mild, stable pelvic fractures usually heal well with treatment without long-term complications.Severe and unstable pelvic fractures that are caused by high-impact events such as car accidents could result in complications such as severe bleeding and organ and/or nerve damage. If these related injuries are treated successfully, the pelvic fracture usually heals well.Why are pelvic fractures life-threatening?Unstable, complex pelvic fractures that are caused by high-impact forces such as a vehicle accident or a significant fall can cause damage to your surrounding organs, nerves and blood vessels in your pelvic region. These subsequent injuries can lead to organ failure, severe bleeding and infection, which can be life-threatening.Can a pelvic fracture cause complications?Severe and unstable pelvic fractures are more likely to cause complications than mild fractures. The complications are usually a result of nerve and/or organ damage that was caused by the pelvic fracture(s). Complications of pelvic fractures can include:Chronic pain.Impaired mobility.Sexual dysfunction.Deep vein thrombosis (DVT), a type of blood clot.Living WithWhen should I see my healthcare provider?If you’re experiencing symptoms of a pelvic fracture such as pain in your pelvic region and difficulty walking or standing, be sure to contact your healthcare provider immediately or go to the nearest hospital.If you’ve already been diagnosed with a fractured pelvis and are experiencing new or concerning symptoms, be sure to contact your healthcare provider.What questions should I ask my doctor?If you have a pelvic fracture, it may be helpful to ask your healthcare provider the following questions:What kind of fracture do I have?Which bones in my pelvis are affected?What does my treatment plan look like?How long will it take for my fracture to heal?When can I return to normal activities?A note from Cleveland ClinicEven though your pelvis is a strong and stable bone structure, it can break. A pelvis fracture is painful, and you’ll want to get help with it right away. Since your pelvis protects many important nerves, blood vessels and organs, your healthcare provider will want to make sure you don’t have any other internal injuries from the fracture. Be sure to talk to your healthcare provider if you’re concerned about osteoporosis, too.Medically ReviewedLast reviewed by a Cleveland Clinic medical professional on 12/08/2021.Learn more about our editorial process.ReferencesAdvertisementCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. PolicyCare at Cleveland ClinicGet Orthopaedic CareMake an AppointmentAdAdvertisementAdvertisementAdvertisementAppointments 216.444.2606Appointments & LocationsRequest an AppointmentFacebookTwitterYouTubeInstagramLinkedInPinterestSnapchatActionsAppointments & AccessAccepted InsuranceEvents CalendarFinancial AssistanceGive to Cleveland ClinicPay Your Bill OnlineRefer a PatientPhone DirectoryVirtual Second OpinionsVirtual VisitsBlog, News & AppsConsult QDHealth EssentialsNewsroomMyClevelandClinicMyChartAbout Cleveland Clinic100 Years of Cleveland ClinicAbout UsLocationsQuality & Patient SafetyOffice of Diversity & InclusionPatient ExperienceResearch & InnovationsCommunity CommitmentCareersFor EmployeesResources for Medical ProfessionalsSite Information & PoliciesSend Us FeedbackSite MapAbout this WebsiteCopyright, Reprint & LicensingWebsite Terms of UsePrivacy PolicyNotice of Privacy PracticesNon-Discrimination Notice9500 Euclid Avenue, Cleveland, Ohio 44195 | 800.223.2273 | © 2024 Cleveland Clinic. All Rights Reserved.\n"
}