{
    "corpus": "Hip fracture - Diagnosis & treatment - Mayo Clinic\n\nHip fractureDiagnosisA health care provider can often diagnose a hip fracture based on symptoms and the abnormal position of the hip and leg. An X-ray usually will confirm the fracture and show where the fracture is.If your X-ray doesn't show a fracture but you still have hip pain, your provider might order an MRI or bone scan to look for a hairline fracture.Most hip fractures occur in one of two locations on the long bone that extends from the pelvis to your knee (femur):\nThe femoral neck. This area is situated in the upper portion of your femur, just below the ball part (femoral head) of the ball-and-socket joint.\nThe intertrochanteric region. This region is a little farther down from the hip joint, in the portion of the upper femur that juts outward.\nTreatmentTreatment for hip fracture usually involves a combination of prompt surgical repair, rehabilitation, and medication to manage pain and to prevent blood clots and infection.SurgeryThe type of surgery generally depends on where and how severe the fracture is, whether the broken bones aren't properly aligned (displaced), and your age and underlying health conditions. Options include:\nInternal repair using screws. Metal screws are inserted into the bone to hold it together while the fracture heals. Sometimes screws are attached to a metal plate that runs down the thighbone (femur).\nTotal hip replacement. The upper femur and the socket in the pelvic bone are replaced with artificial parts (prostheses). Increasingly, studies show total hip replacement to be more cost-effective and associated with better long-term outcomes in otherwise healthy adults who live independently.\nPartial hip replacement. In some situations, the socket part of the hip doesn't need to be replaced. Partial hip replacement might be recommended for adults who have other health conditions or who no longer live independently.\nSurgeons may recommend a full or partial hip replacement if the blood supply to the ball part of the hip joint was damaged during the fracture. That type of injury, which occurs most often in older people with femoral neck fractures, means the bone is less likely to heal properly.RehabilitationPhysical therapy will initially focus on range-of-motion and strengthening exercises. Depending on the type of surgery and whether there's help at home, going to an extended care facility might be necessary.In extended care and at home, an occupational therapist teaches techniques for independence in daily life, such as using the toilet, bathing, dressing and cooking. An occupational therapist will determine if a walker or wheelchair might be needed to regain mobility and independence.Preparing for your appointmentYou may be referred to an orthopedic surgeon.What to expectYour health care provider might ask:\nHave you recently fallen or had another injury to your hip?\nHow severe is your pain?\nCan you put weight on your leg on the side of your injured hip?\nHave you had a bone density test?\nHave you been diagnosed with any other medical conditions? What medications do you take, including vitamins and supplements?\nDo you use alcohol or tobacco?\nHave you ever had surgery? Were there problems?\nDo any of your blood relatives — such as a parent or sibling — have a history of bone fractures or osteoporosis?\nDo you live independently?\n By Mayo Clinic Staff Terms & Conditions Notice of Nondiscrimination Privacy Policy Advertising & Sponsorship Policy Notice of Privacy Practices Accessibility Statement Manage Cookies Site Map© 1998-2024 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved.\nCON-20373451"
}