{
    "corpus": "\n\n\n\n\nBroken wrist - Diagnosis and treatment - Mayo Clinic\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis content does not have an English version.This content does not have an Arabic version.\n\n\n\nSkip to contentCare at \n Mayo Clinic Patient-Centered Care About Mayo Clinic Request Appointment Find a Doctor Locations Clinical Trials Connect to Support Groups Patient & Visitor Guide Insurance & Billing Departments & Centers International Services Contact UsPatient & Visitor Guide Health \n Library Diseases & Conditions Symptoms Tests & Procedures Drugs & Supplements Healthy Lifestyle Books & SubscriptionsDiseases & Conditions For Medical \n Professionals Medical Professional Resources Refer a Patient Continuing Medical Education AskMayoExpert Mayo Clinic Laboratories Video Center Journals & Publications Mayo Clinic Alumni AssociationContinuing Medical Education Research & Education \n at Mayo ClinicResearch Research at Mayo Clinic Research Faculty Laboratories Core Facilities Centers & Programs Departments & Divisions Clinical Trials Institutional Review Board Postdoctoral Fellowships Training Grant ProgramsEducation Mayo Clinic College of Medicine and Science Mayo Clinic Graduate School of Biomedical Sciences Mayo Clinic Alix School of Medicine Mayo Clinic School of Graduate Medical Education Mayo Clinic School of Health Sciences Mayo Clinic School of Continuous Professional DevelopmentMayo Clinic College of Medicine and Science Giving to \n Mayo Clinic Give Now Giving to Mayo Clinic Frequently Asked Questions Contact Us to GiveMake a Donation  Request appointment Log inSearchMenu Request appointment Donate Diseases & conditions Find a doctorCare at Mayo Clinic Patient-Centered Care About Mayo Clinic Request Appointment Find a Doctor Locations Clinical Trials Connect to Support Groups Patient & Visitor Guide Insurance & Billing Departments & Centers International Services Contact UsPatient & Visitor Guide Health Library Diseases & Conditions Symptoms Tests & Procedures Drugs & Supplements Healthy Lifestyle Books & SubscriptionsDiseases & Conditions For Medical Professionals Medical Professional Resources Refer a Patient Continuing Medical Education AskMayoExpert Mayo Clinic Laboratories Video Center Journals & Publications Mayo Clinic Alumni AssociationContinuing Medical Education Research & Education at Mayo ClinicResearch Research at Mayo Clinic Research Faculty Laboratories Core Facilities Centers & Programs Departments & Divisions Clinical Trials Institutional Review Board Postdoctoral Fellowships Training Grant ProgramsEducation Mayo Clinic College of Medicine and Science Mayo Clinic Graduate School of Biomedical Sciences Mayo Clinic Alix School of Medicine Mayo Clinic School of Graduate Medical Education Mayo Clinic School of Health Sciences Mayo Clinic School of Continuous Professional DevelopmentMayo Clinic College of Medicine and Science Giving to Mayo Clinic Give Now Giving to Mayo Clinic Frequently Asked Questions Contact Us to GiveMake a Donation \n\n\n\n\n\n\n\n\n\nPatient Care & Health Information\nDiseases & Conditions\n\n\nBroken wrist\n\nRequest an Appointment\nSymptoms &causesDiagnosis &treatmentDoctors &departments\n\n\n\n\n\n\nPrint\n\n\nDiagnosisThe diagnosis of a broken wrist generally includes a physical exam of the affected hand and X-rays.\nOther imaging testsSometimes, other imaging tests can give your doctor more detail. They are:\n\nCT scan. CT scans can uncover wrist fractures that X-rays miss. Injuries to soft tissues and blood vessels can be seen on CT scans. This technology takes X-rays from a variety of angles and combines them to depict cross-sectional slices of your body's internal structures.\nMRI. Using radio waves and a powerful magnet to produce detailed images of bone and soft tissues, MRIs are much more sensitive than X-rays and can identify very small fractures and ligament injuries.\nMore InformationBone scanCT scanMRIX-rayShow more related information\n\nTreatmentIf the broken ends of the bone aren't aligned properly, there can be gaps between the pieces of bone or fragments might overlap. Your doctor will need to manipulate the pieces back into position, a procedure known as a reduction. Depending on the amount of pain and swelling you have, you might need a local or general anesthetic before this procedure.\nWhatever your treatment, it's important to move your fingers regularly while the fracture is healing to keep them from stiffening. Ask your doctor about the best ways to move them. If you smoke, quit. Smoking can delay or prevent bone healing.\nImmobilizationRestricting the movement of a broken bone in your wrist is critical to proper healing. To do this, you'll likely need a splint or a cast. You'll be advised to keep your hand above heart level as much as possible to reduce swelling and pain.\nMedicationsTo reduce pain, your doctor might recommend an over-the-counter pain reliever. If your pain is severe, you might need an opioid medication, such as codeine.\nNSAIDs can help with pain but might also hamper bone healing, especially if used long-term. Ask your doctor if you can take them for pain relief.\nIf you have an open fracture, in which you have a wound or break in the skin near the wound site, you'll likely be given an antibiotic to prevent infection that could reach the bone.\nTherapyAfter your cast or splint is removed, you'll likely need rehabilitation exercises or physical therapy to reduce stiffness and restore movement in your wrist. Rehabilitation can help, but it can take several months or longer for complete healing.\nSurgical and other procedures\n\n\n\n\r\n\t    External fixation of the wrist\r\n\t    Enlarge image\n\n\n\n\n\n\n\n\n\nClose\n\n\n\nExternal fixation of the wrist\n\n\nExternal fixation of the wrist\nWith external fixation, a metal frame outside your body immobilizes the fracture with two or more pins that pass through your skin and into the bone on either side of the fracture.\n\n\n\n\n\nYou might need surgery to implant pins, plates, rods or screws to hold your bones in place while they heal. A bone graft might be used to help healing. These options might be necessary if you have:\n\nAn open fracture\nA fracture in which the bone pieces move before they heal\nLoose bone fragments that could enter a joint\nDamage to the surrounding ligaments, nerves or blood vessels\nFractures that extend into a joint\n\nEven after reduction and immobilization with a cast or splint, your bones can shift. So your doctor likely will monitor your progress with X-rays. If your bones move, you might then need surgery.\nIn some cases, the surgeon will immobilize your fracture by using an external fixation device. This consists of a metal frame with two or more pins that go through your skin and into the bone on both sides of the fracture.\nRequest an appointment\n\nClinical trials\n\nExplore Mayo Clinic studies testing new treatments, interventions and tests as a means to prevent, detect, treat or manage this condition.\r\n    \nPreparing for your appointmentYou might first seek treatment for a broken wrist in an emergency room or urgent care clinic. If the pieces of broken bone aren't lined up properly to allow healing with immobilization, you might be referred to a doctor specializing in orthopedic surgery.\nWhat you can doYou may want to write a list that includes:\n\nA description of your symptoms and how, where and when the injury occurred\nInformation about your and your family's medical histories\nAll the medications and dietary supplements you take, including doses\nQuestions you want to ask the doctor\n\nFor a broken wrist, questions to ask your doctor include:\n\nWhat tests do I need?\nWhat's the best course of action?\nWill I need surgery?\nWill I need to wear a cast? If so, for how long?\nWill I need physical therapy when the cast comes off?\nAre there restrictions that I need to follow?\nShould I see a specialist?\n\n What to expect from your doctorYour doctor might ask:\n\nWhat is your occupation?\nWas your wrist bent backward or forward when the impact occurred?\nAre you right-handed or left-handed?\nWhere does it hurt, and do certain movements make it hurt more or less?\nHave you had previous wrist injuries or surgery?\n\nBy Mayo Clinic Staff\n\nRequest an appointment\n\nSymptoms & causesDoctors & departments\n\r\n    June 29, 2022\r\n\nPrint\n\nShow references\nWrist fractures. American Society for Surgery of the Hand. http://www.assh.org/handcare/hand-arm-injuries/wrist-fractures. Accessed April 20, 2017.\nSebastin S, et al. Overview of finger, hand, and wrist fractures. https://www.uptodate.com/home. Accessed April 20, 2017.\nScaphoid fracture of the wrist. American Academy of Orthopaedic Surgeons. http://orthoinfo.aaos.org/topic.cfm?topic=A00012. Accessed April 20, 2017.\nWilliams AA, et al. Pediatric hand and wrist injuries. Current Reviews in Musculoskeletal Medicine. 2013;6:18.\nPetron DJ. Distal radius fractures in adults. https://www.uptodate.com/home. Accessed April 20, 2017.\nBone health. National Institute for Arthritis and Musculoskeletal and Skin Diseases. http://www.niams.nih.gov/Health_Info/Bone_Health/default.asp. Accessed April 21, 2017.\nPountos I, et al. Do nonsteroidal anti-inflammatory drugs affect bone healing? A critical analysis. The Scientific World Journal. 2012;2012:606404. https://www.hindawi.com/journals/tswj/2012/606404/. Accessed May 22, 2017.\n\n\n\n\nRelated\n\n\n\nColles' fracture\n\n\nExternal fixation of the wrist\n\n\n\n\nAssociated Procedures\n\n\nBone scan\n\n\nCT scan\n\n\nMRI\n\n\nX-ray\n\n\nShow more associated procedures\n\n\nNews from Mayo Clinic\n\n\nMayo Clinic Minute: Why wrists are a common casualty of winter\nJan. 11, 2023, 05:00 p.m.  CDT\n\n\n\n\nProducts & Services\n\n\nA Book: Mayo Clinic on Osteoporosis\n\n\nMayo Clinic Sports Medicine\n\n\nShow more products and services from Mayo Clinic\n\n\n\n\n\n\nBroken wristSymptoms&causesDiagnosis&treatmentDoctors&departments\n\n\n\n\n\n\nAdvertisement\n\n\n\nMayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission.\nAdvertising & Sponsorship\n\nPolicy\nOpportunities\nAd Choices\n\n\n\n\nMayo Clinic Press\nCheck out these best-sellers and special offers on books and newsletters from Mayo Clinic Press.\nMayo Clinic on Incontinence - Mayo Clinic PressMayo Clinic on IncontinenceThe Essential Diabetes Book - Mayo Clinic PressThe Essential Diabetes BookMayo Clinic on Hearing and Balance - Mayo Clinic PressMayo Clinic on Hearing and BalanceFREE Mayo Clinic Diet Assessment - Mayo Clinic PressFREE Mayo Clinic Diet AssessmentMayo Clinic Health Letter - FREE book - Mayo Clinic PressMayo Clinic Health Letter - FREE book\n\n\n\n\n\n\n\n\n\n\n\nCON-20310622\n\n\nPatient Care & Health Information\nDiseases & Conditions\nBroken wrist\n\n\n\n\n\n\n\n\n\nYour gift holds great power – donate today! DonateMake your tax-deductible gift and be a part of the cutting-edge research and care that's changing medicine.\n Donate\n\n Find a doctor Explore careers Sign up for free e-newslettersAbout Mayo Clinic   About this Site Contact Us Locations Health Information Policy Media Requests News Network Price TransparencyMedical Professionals  AskMayoExpert Clinical Trials Mayo Clinic Alumni Association Refer a PatientBusinesses   Executive Health Program International Business Collaborations Facilities & Real Estate Supplier InformationMedical Professionals  AskMayoExpert Clinical Trials Mayo Clinic Alumni Association Refer a PatientBusinesses   Executive Health Program International Business Collaborations Facilities & Real Estate Supplier InformationStudents    Admissions Requirements Degree Programs Student & Faculty PortalStudents   Degree Programs Admissions Requirements Student & Faculty PortalResearchers   Research Faculty LaboratoriesInternational Patients  Appointments Financial Services International Locations & OfficesCharitable Care & Financial Assistance  Community Health Needs Assessment Financial Assistance Documents – Arizona Financial Assistance Documents – Florida Financial Assistance Documents – MinnesotaFollow Mayo Clinic X Youtube Facebook Linkedin InstagramGet the Mayo Clinic app\n\n Terms & Conditions Privacy Policy Notice of Privacy Practices Notice of Nondiscrimination Accessibility Statement Advertising & Sponsorship Policy Site Map Manage Cookies Terms and Conditions Privacy Policy Notice of Privacy Practices Notice of Nondiscrimination Accessibility Statement Advertising and Sponsorship Policy Site Map Manage CookiesLanguage:English English Español العربية 简体中文© 1998-2024 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved.\nLanguage:English English Español العربية 简体中文\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}