{
    "corpus": "Broken ankle - Symptoms & causes - Mayo Clinic\n\nSkip to contentCare at \n Mayo Clinic Patient-Centered Care About Mayo Clinic Request Appointment Find a Doctor Locations Clinical Trials Connect to Support Groups Patient & Visitor Guide Insurance & Billing Departments & Centers International Services Contact UsPatient & Visitor Guide Health \n Library Diseases & Conditions Symptoms Tests & Procedures Drugs & Supplements Healthy Lifestyle Books & SubscriptionsDiseases & Conditions For Medical \n Professionals Medical Professional Resources Refer a Patient Continuing Medical Education AskMayoExpert Mayo Clinic Laboratories Video Center Journals & Publications Mayo Clinic Alumni AssociationContinuing Medical Education Research & Education \n at Mayo ClinicResearch Research at Mayo Clinic Research Faculty Laboratories Core Facilities Centers & Programs Departments & Divisions Clinical Trials Institutional Review Board Postdoctoral Fellowships Training Grant ProgramsEducation Mayo Clinic College of Medicine and Science Mayo Clinic Graduate School of Biomedical Sciences Mayo Clinic Alix School of Medicine Mayo Clinic School of Graduate Medical Education Mayo Clinic School of Health Sciences Mayo Clinic School of Continuous Professional DevelopmentMayo Clinic College of Medicine and Science Giving to \n Mayo Clinic Give Now Giving to Mayo Clinic Frequently Asked Questions Contact Us to GiveMake a Donation  Request appointment Log inSearchMenu Request appointment Donate Diseases & conditions Find a doctorCare at Mayo Clinic Patient-Centered Care About Mayo Clinic Request Appointment Find a Doctor Locations Clinical Trials Connect to Support Groups Patient & Visitor Guide Insurance & Billing Departments & Centers International Services Contact UsPatient & Visitor Guide Health Library Diseases & Conditions Symptoms Tests & Procedures Drugs & Supplements Healthy Lifestyle Books & SubscriptionsDiseases & Conditions For Medical Professionals Medical Professional Resources Refer a Patient Continuing Medical Education AskMayoExpert Mayo Clinic Laboratories Video Center Journals & Publications Mayo Clinic Alumni AssociationContinuing Medical Education Research & Education at Mayo ClinicResearch Research at Mayo Clinic Research Faculty Laboratories Core Facilities Centers & Programs Departments & Divisions Clinical Trials Institutional Review Board Postdoctoral Fellowships Training Grant ProgramsEducation Mayo Clinic College of Medicine and Science Mayo Clinic Graduate School of Biomedical Sciences Mayo Clinic Alix School of Medicine Mayo Clinic School of Graduate Medical Education Mayo Clinic School of Health Sciences Mayo Clinic School of Continuous Professional DevelopmentMayo Clinic College of Medicine and Science Giving to Mayo Clinic Give Now Giving to Mayo Clinic Frequently Asked Questions Contact Us to GiveMake a Donation Diseases & ConditionsDiseases & ConditionsBroken ankle Request an appointmentSymptoms &causesDiagnosis &treatmentDoctors &departmentsOn this page Overview Symptoms When to see a doctor Causes Risk factors Complications PreventionOverviewA broken or fractured ankle is an injury to the bone. You may experience a broken ankle from a twisting injury from a simple misstep or fall, or from direct trauma during a car crash, for example.Foot and ankle bones\n        A fall or blow to your ankle can break one or more of the three bones in your ankle joint the fibula, the tibia and the talus. Rolling your ankle can cause a break in the knobby bumps at the end of the tibia and fibula.\n        The seriousness of a broken ankle varies. Fractures can range from tiny cracks in your bones to breaks that pierce your skin.Treatment for a broken ankle depends on the exact site and severity of the bone fracture. A severely broken ankle may require surgery to implant plates, rods or screws into the broken bone to maintain proper position during healing.Products & Services A Book: Mayo Clinic Family Health Book, 5th Edition Mayo Clinic Sports Medicine Newsletter: Mayo Clinic Health Letter — Digital EditionSymptomsIf you have a broken ankle, you may experience some of the following signs and symptoms:\nImmediate, throbbing pain\nSwelling\nBruising\nTenderness\nDeformity\nDifficulty or pain with walking or bearing weight\nWhen to see a doctorSee a doctor if there is obvious deformity, if the pain and swelling don't get better with self-care, or if the pain and swelling get worse over time. Also, see a doctor if the injury interferes with walking. Request an appointmentCausesA broken ankle is usually a result of a twisting injury, but can also be caused by a direct blow to the ankle.The most common causes of a broken ankle include:\nCar accidents. The crushing injuries common in car accidents may cause breaks that require surgical repair.\nFalls. Tripping and falling can break bones in your ankles, as can landing on your feet after jumping down from just a slight height.\nMissteps. Sometimes just putting your foot down wrong can result in a twisting injury that can cause a broken bone.\nRisk factorsYou may be at higher risk of a broken ankle if you:\nParticipate in high-impact sports. The stresses, direct blows and twisting injuries that occur in sports such as basketball, football, gymnastics, tennis and soccer can cause ankle fractures.\nUse improper technique or sports equipment. Faulty equipment, such as shoes that are too worn or not properly fitted, can contribute to stress fractures and falls. Improper training techniques, such as not warming up and stretching, also can cause ankle injuries.\nSuddenly increase your activity level. Whether you're a trained athlete or someone who's just started exercising, suddenly boosting the frequency or duration of your exercise sessions can increase your risk of a stress fracture.\nKeep your home cluttered or poorly lit. Walking around in a house with too much clutter or too little light may lead to falls and ankle injuries.\nHave certain conditions. Having decreased bone density (osteoporosis) can put you at risk of injuries to your ankle bones.\nSmoking. Cigarette smoking can increase your risk of developing osteoporosis. Studies also show that healing after a fracture may take longer in people who smoke.\nComplicationsComplications of a broken ankle are uncommon but may include:\nArthritis. Fractures that extend into the joint can cause arthritis years later. If your ankle starts to hurt long after a break, see your doctor for an evaluation.\nBone infection (osteomyelitis). If you have an open fracture, meaning one end of the bone protrudes through the skin, your bone may be exposed to bacteria that cause infection.\nCompartment syndrome. This condition can rarely occur with ankle fractures. It causes pain, swelling and sometimes disability in affected muscles of the legs.\nNerve or blood vessel damage. Trauma to the ankle can injure nerves and blood vessels, sometimes actually tearing them. Seek immediate attention if you notice any numbness or circulation problems. Lack of blood flow can cause a bone to die and collapse.\nPreventionThese basic sports and safety tips may help prevent a broken ankle:\nWear proper shoes. Use hiking shoes on rough terrain. Choose appropriate athletic shoes for your sport.\nReplace athletic shoes regularly. Discard sneakers as soon as the tread or heel wears out or if the shoes are wearing unevenly. If you're a runner, replace your sneakers every 300 to 400 miles.\nStart slowly. That applies to a new fitness program and each individual workout.\nCross-train. Alternating activities can prevent stress fractures. Rotate running with swimming or biking.\nBuild bone strength. Get enough calcium and vitamin D. Calcium-rich foods include milk, yogurt and cheese. Ask your doctor if you need to take vitamin D supplements.\nDeclutter your house. Keeping clutter off the floor can help you to avoid trips and falls.\nStrengthen your ankle muscles. If you are prone to twisting your ankle, ask your doctor for exercises to help strengthen the supporting muscles of your ankle.\n Request an appointment By Mayo Clinic StaffMar 26, 2022 PrintShow ReferencesBrunicardi FC, et al., eds. Orthopedic surgery. In: Schwartz's Principles of Surgery. 11th ed. McGraw-Hill Education; 2019. https://www.accessmedicine.mhmedical.com. Accessed Feb. 9, 2020.Sprains, strains and fractures. American Podiatric Medical Association. https://www.apma.org/Patients/FootHealth.cfm?ItemNumber=982. Accessed Feb. 9, 2020.Fowler GC, et al., eds. Fracture care. In: Pfenninger and Fowler's Procedures for Primary Care. 4th ed. Elsevier; 2020. https://www.clinicalkey.com. Accessed Feb. 9, 2020.Miller MD, et al., eds. Ankle fractures. In: Essential Orthopaedics. 2nd ed. Elsevier; 2020. https://www.clinicalkey.com. Accessed Feb. 9, 2020.Koehler SM. Overview of ankle fractures in adults. https://www.uptodate.com/contents/search. Accessed Feb. 9, 2020.Boutis K. Ankle fractures in children. https://www.uptodate.com/contents/search. Accessed Feb. 9, 2020.Broken ankle (foot fractures). American Orthopaedic Foot & Ankle Society. https://www.footcaremd.org/conditions-treatments/ankle/broken-ankle. Accessed Feb. 9, 2020.How to identify a broken ankle. American Orthopaedic Foot & Ankle Society. https://www.footcaremd.org/resources/how-to-help/how-to-identify-broken-ankle. Accessed Feb. 9, 2020.Preventing fractures and falls. National Osteoporosis Foundation. https://www.nof.org/patients/fracturesfall-prevention/. Accessed Feb. 9, 2020.AskMayoExpert. Ankle fracture (adult). Mayo Clinic; 2019.Open fractures. American Academy of Orthopaedic Surgeons. https://orthoinfo.aaos.org/en/diseases--conditions/open-fractures/. Accessed Feb. 9, 2020.Smoking and bone health. National Institutes of Health Osteoporosis and Related Bone Diseases National Resource Center. https://www.bones.nih.gov/health-info/bone/osteoporosis/conditions-behaviors/bone-smoking. Accessed Feb. 9, 2020.Stress fractures. American Academy of Orthopaedic Surgeons. https://orthoinfo.aaos.org/en/diseases--conditions/stress-fractures. Accessed Feb. 9, 2020. Diagnosis & treatmentDiseases & ConditionsBroken ankle symptoms & causesMore Information Avulsion fracture Foot and ankle bonesAssociated Procedures Bone scan CT scan MRI X-rayProducts & Services A Book: Mayo Clinic Family Health Book, 5th Edition Mayo Clinic Sports Medicine Newsletter: Mayo Clinic Health Letter — Digital EditionCON-XXXXXXXXSkip AdvertisementAdvertisementMayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission.\nAdvertising & SponsorshipPolicyOpportunitiesAd ChoicesMayo Clinic PressCheck out these best-sellers and special offers on books and newsletters from Mayo Clinic Press.\n Mayo Clinic on Incontinence The Essential Diabetes Book Mayo Clinic on Hearing and Balance FREE Mayo Clinic Diet Assessment Mayo Clinic Health Letter - FREE bookAdvertisementYour gift holds great power – donate today! DonateMake your tax-deductible gift and be a part of the cutting-edge research and care that's changing medicine.\n Donate Find a doctor Explore careers Sign up for free e-newslettersAbout Mayo Clinic   About this Site Contact Us Locations Health Information Policy Media Requests News Network Price TransparencyMedical Professionals  AskMayoExpert Clinical Trials Mayo Clinic Alumni Association Refer a PatientBusinesses   Executive Health Program International Business Collaborations Facilities & Real Estate Supplier InformationMedical Professionals  AskMayoExpert Clinical Trials Mayo Clinic Alumni Association Refer a PatientBusinesses   Executive Health Program International Business Collaborations Facilities & Real Estate Supplier InformationStudents    Admissions Requirements Degree Programs Student & Faculty PortalStudents   Degree Programs Admissions Requirements Student & Faculty PortalResearchers   Research Faculty LaboratoriesInternational Patients  Appointments Financial Services International Locations & OfficesCharitable Care & Financial Assistance  Community Health Needs Assessment Financial Assistance Documents – Arizona Financial Assistance Documents – Florida Financial Assistance Documents – MinnesotaFollow Mayo Clinic X Youtube Facebook Linkedin InstagramGet the Mayo Clinic app Terms & Conditions Privacy Policy Notice of Privacy Practices Notice of Nondiscrimination Accessibility Statement Advertising & Sponsorship Policy Site Map Manage Cookies Terms and Conditions Privacy Policy Notice of Privacy Practices Notice of Nondiscrimination Accessibility Statement Advertising and Sponsorship Policy Site Map Manage CookiesLanguage:English English Español العربية 简体中文© 1998-2024 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved.\nLanguage:English English Español العربية 简体中文"
}